[
{"type": "part-time", "text": "Adwords Person (In-Office Individual)", "address": ["\n        ", "\nWe are looking for someone who has at least 3 years' experience with Adwords to work out of our office one day a week (we have some flexibility on the day), or two half-days. We have a lot of experience with Adwords ourselves and recently attended SMX for 8 hours with the Google people. We are looking for someone who dresses and acts professionally, and is interested in being better with Adwords, someone who can keep us at the cutting edge with results that we can see. ", "\n", "\nYou should be a person who pays attention to detail, has a friendly outlook and disposition, and someone who cares enough about what they do to be on top of their game; we are looking to hire an individual for our own strategic reasons and will delete all emails from companies, so companies please save your time, we already have one. Also, no long-distance work, this is an in-office position so please do not apply if you are not in San Diego. ", "\n", "\nPlease send a cover letter explaining your choice of days of the week and hourly rate. Tell us about your experience with Adwords and why you should be our first choice. This is a permanent part-time position for the right person; the hours may increase and at some point may lead to a career full-time position.    "], "link": "https://sandiego.craigslist.org/csd/web/d/adwords-person-in-office/6570447818.html", "compensation": "DOE please inform your rate in cover letter (we will delete those that ignore it)", "date": "2018-04-24 12:34"},
{"type": "contract", "text": "Internet Marketing Technician Job Vacancy", "address": ["\n        ", "\n- Individual APPLICANTS only, companies please DON'T offer your services ", "\n- No Students, this is FULL time position", "\n- No remote workers ", "\n------------------------------------------------------------------------------------------------", "\nAt iQtropics, we specialize in nootropic, brain enhancing smart drinks.", "\n", "\nWe are currently seeking a full time, hardworking, talented Junior Internet Marketing Technician to join our team. This job description does not attempt to define, in detail, all duties and responsibilities and may be subject to review and alteration by the company.", "\n", "\nJOB DUTIES Include:", "\nCreating and updating company social content and strategic advertisement", "\nSearch Engine Optimization", "\nSearch Engine Marketing", "\nWebmaster Tools", "\nAnalytics", "\nAdsense", "\nAdwords", "\nManagement of traffic generating tools", "\nAffiliate platform management", "\nAffiliate marketing with blogs and forums", "\nGoogle Shopping", "\nAmazon Shopping", "\nSocial media Ad campaigns (Facebook, Instagram, YouTube etc)", "\nEmail Campaigns", "\nShopify Backoffice", "\nOntraport or MailChimp", "\nPush notification mobile campaigns", "\nWordPress", "\nShopify", "\nEmail Marketing", "\nContent Marketing", "\n", "\nBENEFITS:", "\nSalary: $20.00 to $25.00 /hour depending on experience", "\nTraining provided", "\nValuable future proof skills and financial education", "\n", "\nREQUIREMENTS:", "\nResourcefulness", "\nAbility to enjoy solving problems", "\nAbility to learn as you go", "\nWillingness to learn and improve on existing methods", "\nTrack record of completed projects", "\nPassion for IT", "\nWorking directly with executive team", "\nQuality minded, positive team player, problem solver,", "\n\"Can do right on it\" attitude", "\n1 -3 years IT experience", "\nAbility to adapt and learn various positions and procedures", "\nAbility to work independently and follow directions", "\nEffectively read, write and communicate in English", "\nRelevant work experience preferred.", "\nMust have flexible availability to work mornings, evenings, weekends and holidays with minimal personal commitments and responsibilities.", "\n", "\nBASIC UNDERSTANDING in:", "\nWebsite Design", "\nVideo Editing", "\nGraphics Editing", "\nWikipedia editing", "\nThis position requires at least 2 years of relevant work experience", "\nAPPLY here: ", "\n", "\nWe will email candidates who made to shortlist for interview.", "\n", "\n", "\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status or disability status.", "\n", "\n", "\nLocation: San Diego / Kearny Mesa", "\nThis is a Full-time job.", "\nThe Probation Period - 3 months.    "], "link": "https://sandiego.craigslist.org/ssd/web/d/internet-marketing-technician/6556837843.html", "compensation": "$20.00 to $25.00 /hour depending on experience", "date": "2018-04-09 23:28"},
{"type": "full-time", "text": "Full time Front End Web Designer- Wordpress / HTML", "address": ["\n        ", "\n*This is an in-house position ONLY! You must live in  San Diego to be considered.", "\n", "\nLadies and Gentlemen", "\n", "\nWe're a boutique web development and marketing agency in the Little Italy area of San Diego, CA seeking a creative, skilled, energetic, hardworking,  and all-around cool person to come join our team. We build websites, micro-sites, apps, content management systems, databases and more. We build these for small businesses and major brand names alike. We work as a team to develop new websites in both HTML and WordPress formats. ", "\n", "\n", "\nRequired skillset for this position:", "\n", "\n•\tHTML5/CSS3 Expert (Be able to cut and code PSD mocks into pixel-perfect web pages from SCRATCH)", "\n•\tClean eye for design and typography/Strong design and layout skills (Extreme attention to detail with paddings, margins, line-heights, letter-spacing, etc)", "\n•\tPhotoshop expertise required", "\n•\tBootstrap or Foundation experience", "\n•\tResponsive/media queries expert (Our websites should look great on every device size)", "\n•\tAdvanced WordPress proficiency (Theme manipulation through advanced CSS, knowledge of actions and functions.php)", "\n•\tKnowledge of page speed optimization (Know when to use PNG's vs. JPG's, appropriately size images, etc)", "\n•\tSome experience with Javascript/jQuery (Ideal candidate can manipulate and use jQuery plugins for animations and general UI/UX functionality)", "\n•\tHTML Email Blast Experience (We use MailChimp)", "\n•\tPortfolio with live working web pages of your recent work", "\n•\tExperience with .PHP", "\n", "\nCandidate's responsibilities include:", "\n", "\n•\tBuild New Websites using WordPress", "\n•\tBuild New Websites, microsites and landing pages from scratch using Bootstrap/Foundation", "\n•\tImplement, maintain and update WordPress Websites", "\n•\tOn-going enhancements to existing websites", "\n•\tCreate quality mockups on tight timelines", "\n•\tFamiliar with UI development, landing pages", "\n•\tAbility to make a website responsive to multiple device and multiple browsers", "\n•\tStay up-to-date on emerging technologies", "\n", "\n", "\nTO APPLY:", "\n", "\n-Resume & cover letter ", "\n-Portfolio of your best and most recent work", "\n", "\nThis is a full-time in-house position ONLY! You must live in  San Diego to be considered. No freelancers.", "\n", "\nCompensation: $50k - $55k ", "\nHealth Insurance Benefits: Yes", "\nPaid Vacation: Yes - accrues after probation period ends    "], "link": "https://sandiego.craigslist.org/csd/web/d/full-time-front-end-web/6557199599.html", "compensation": "$50k - $55k base (other compensation will be available)", "date": "2018-04-10 10:12"},
{"type": "employee's choice", "text": "Marketing assistant", "address": ["\n        ", "\nWe are seeking a professional, detail-oriented individual who can multi-task; has exceptional organization & excellent computer skills for a Top producing team in North County. The ideal candidate will be an energetic team player who takes initiative to get the job done. ", "\n", "\nJob Duties: ", "\n•\tAnswering telephones", "\n•\tScheduling appointments", "\n•\tPreparing Advertising for magazines and newspapers", "\n•\tPosting on social media platforms. Creating engaging/ visually aesthetic content for our audience", "\n•\tCreating/posting video content marketing to increase brand awareness and sales", "\n•\tAssisting Sales agents with miscellaneous projects", "\n•\tHelping set up and documenting events, open houses, video shoots, etc. ", "\n•\tManage company reviews (acquire more and respond) on Yelp, Google Business, Facebook", "\n•\tProviding overall support to lead agent. ", "\n", "\nREQUIRED SKILLS:", "\n", "\n•\tCreative marketing and advertising with a passion for social media and familiarity with platforms including but not limited to Facebook, Instagram, Pinterest, and Twitter", "\n•\tExperience in using video as a tool for marketing to build our brand and increase sales", "\n•\tExcellent written AND verbal communication skills", "\nCustomer service - Comfortable speaking/engaging with clients", "\n•\tFast learner comfortable with all things digital/tech", "\n•\tAttention to detail ", "\n•\tDemonstrated ability to multi-task and meet a variety of deadlines ", "\n•\tPositive and professional attitude", "\n•\tWork in a team environment", "\n", "\nAn understanding of the real estate industry is helpful but not required. There is definite room for growth with this position for the right candidate.", "\nMust have a cover letter or will delete application. ", "\nMust live in North County!", "\nPart time or full time available. ", "\nPLEAS NO COMPANIES! LOOKING FOR INDIVIDUAL TO WORK IN OUR OFFICE. ", "\nSEND RESUME, INCLUDING EDUCATION HISTORY, AS A WORD DOCUMENT", "\n    "], "link": "https://sandiego.craigslist.org/nsd/web/d/marketing-assistant/6557201874.html", "compensation": "12-15 PER HOUR PLUS BONUS PER TRANSACTION", "date": "2018-04-10 10:14"},
{"type": "contract", "text": "Jr. Production Artist - Freelance", "address": ["\n        ", "\nOur client in the Casino, Resort, and Hospitality industry is looking for a Production Artist to join their team for the next 4-5 months on a freelance basis for maternity leave coverage.", "\n", "\nIn this role, you will report into the Creative Services Manager and your daily responsibilities will include:", "\n", "\n-Create layout and artwork for ads, signage displays, billboards, promotional materials and sponsorship packages", "\n-Work closely with Graphic Designers to develop production artwork for vendors and/or specific photo or film shoots", "\n- Provide production artwork support for all advertising projects upon request", "\n-Create event branding by providing production artwork during the development phase of advertising campaigns and event and/or department-specific logo design ", "\n-General support to the Creative Services department ", "\n", "\nThe ideal candidate has:", "\n- 1-2+ years of experience", "\n- Proficient in Adobe Creative Suite", "\n- Ability to effectively interact with customers, external agencies, vendors, and team members", "\n- Open to feedback", "\n- Strong time management skills", "\n", "\nThis is an amazing opportunity to build your book with a big name in the industry and a great culture + a friendly team! This is ONSITE FREELANCE IN EL CAJON.    "], "link": "https://sandiego.craigslist.org/csd/web/d/jr-production-artist-freelance/6557236654.html", "compensation": "up to $20ph/DOE", "date": "2018-04-10 10:42"},
{"type": "full-time", "text": "Website / Online Marketing Project Specialist", "address": ["\n        ", "\nWe are a local publishing company looking for a full time Website / Online Marketing Project Specialist. This is an in-house position in Carlsbad with opportunity for growth and advancement. We offer a 4-day work week (Monday-Thursday, 7 am - 5:30 pm) with benefits and paid time off.", "\n", "\nPlease read the job description and requirements below and email your resume to be considered for an interview.", "\n", "\nJob Summary:", "\nWith general guidance, manages website properties including website content, new web development, online summits, and marketing of the websites. Responsible for creating and executing website content, website development and web promotional activities under the direction of the Sr. Web Project Manager.", "\n", "\nPrimary Duties and Responsibilities:", "\n", "\n- Completes web deliverables and manages execution of project plans.", "\n- Manages overall marketing of assigned websites and increases traffic to assigned websites.", "\n- Researches and executes plans to continually increase conversions into database names and increase revenue generated from assigned websites.", "\n- Manages various web related projects including development and launch of future phases under the direction of the Web Director and Sr. Web Project Manager.", "\n- Responsible for regular plugin and content updates to WordPress and other custom admin back-ends.", "\n- Communicate project status and updates with team members and website stakeholders.", "\n- Creates and approves content, metadata, creative assets, materials, etc. associated with assigned websites and projects.", "\n- Creates specs for web developers to develop and maintain websites and performs ongoing website Q/A.", "\n- Writes web content as needed for areas in development, and ongoing content as needed.", "\n- Manages online summit schedule and production deadlines to keep projects on task.", "\n- Completes regular reports results of traffic and revenue using web analytics tools and makes recommendations on changes based on data.", "\n- Presents development reviews and suggestions for optimizations in email collection and website membership conversions.", "\n", "\nSkills, Knowledge & Abilities:", "\n•\tExcellent verbal and written communication skills.  ", "\n•\tAbility to manage outside vendors.", "\n•\tAbility to manage multiple projects and priorities simultaneously.", "\n•\tExcellent attention to detail and the ability to effectively multi-task to meet deadlines in a fast-paced environment.", "\n•\tKnowledge of web development, website analytics, and understanding of database driven websites.", "\n•\tKnowledge of WordPress Administration STRONGLY desired.", "\n•\tKnowledge of project management software (Asana, Basecamp, etc.)", "\n•\tTechnological proficiency for use of the personal computer, Microsoft Excel, Word, internet.", "\n•\tGood team oriented attitude - must work closely with interrelated departments/peers.", "\n•\tExperience managing projects and working with executive teams.", "\n•\tBasic HTML knowledge desired, training available.", "\n•\tBasic internet marketing knowledge.", "\n", "\nEducation and/or Experience:", "\n•\tPrior experience typically achieved through 2-4 years of web project management experience, and/or including internet marketing / digital experience.", "\n•\tExperience managing broad scoped projects.", "\n•\tTheoretical knowledge typically achieved through a related four-year college experience, such as a Bachelor's degree in marketing or equivalent.", "\n", "\n", "\nIf you meet these qualifications, please email your resume to be considered for an interview. Thank you!    "], "link": "https://sandiego.craigslist.org/nsd/web/d/website-online-marketing/6557316908.html", "compensation": "55,000 annual salary, depending upon experience", "date": "2018-04-10 11:49"},
{"type": "full-time", "text": "SEO & Digital Marketing Project Manager (Fast Growing Company)", "address": ["\n        ", "\nIgnite Visibility (", "), a fast growing Internet marketing company based in San Diego, is looking for a SEO & Digital Marketing Project Manager to manage 8 to 12 SEO accounts depending on size. ", "\n", "\nIgnite Visibility's core competencies are SEO, social media, PPC, CRO and email. This person must have a strong background in the majority of these areas.", "\n", "\nQualifications", "\n• Must have 3 years' experience in Internet Marketing", "\n• Must have 2 years' experience in SEO", "\n• Agency experience is a must", "\n• Must be knowledgeable of on-site SEO and link building", "\n• Must have done a keyword assignment", "\n• Must have excellent communication skills", "\n• Must have knowledge of social media and how it relates to SEO", "\n• Must have knowledge of technical SEO items", "\n• Must have knowledge of Wordpress and blogging", "\n• Must have knowledge of Facebook, Twitter, Google +, LinkedIn, YouTube", "\nResponsibilities", "\n• Lead weekly meetings with clients", "\n• Ensure campaign deliverables are executed", "\n• Provide client reporting", "\n• Make recommendations for client strategy", "\n• Come up with editorial calendar ideas", "\n• Create client linking strategy", "\n• Manage multiple clients and ensure results", "\n• Lead internal meetings", "\n", "\nThis person should be a go-getter who loves Internet marketing and brings a positive can-do attitude to company! This person needs to have a very strong background in SEO and digital marketing. This is a great position at a growing company. Apply today!", "\nCompetitive salary, benefits, vacation time. ", "\n", "\n", "    "], "link": "https://sandiego.craigslist.org/csd/web/d/seo-digital-marketing-project/6557486088.html", "compensation": "$50,000 a year to $70,000 a year depending on experience", "date": "2018-04-10 14:25"},
{"type": "full-time", "text": "Rockstar Web Designer/Developer For Fast Growing eComm Company", "address": ["\n        ", "\nWHO WE ARE:", "\n", "\nWe are a boutique digital advertising agency with offices in Little Italy, San Diego. From website design and SEO, to content creation and social media marketing, we oversee all aspects of our clients' web presence. We are currently looking for a WEB DESIGNER with experience working in-house, as a contributing member of a graphic and web design team.", "\n", "\nWHO WE'RE LOOKING FOR:", "\n", "\nWe are looking for an experienced and skilled designer. Our ideal candidate is hardworking, focused, with an eye for clean and effective design and strong attention to detail. You will work closely with others on projects that range from content sites, blogs, landing pages and offer pages. In this position you will be expected to work on a variety of projects, including website design, logo design, banner ads, print ads, branding materials, basic HTML/CSS coding and editing, and some photo editing/retouching. The right candidate will be a problem-solver that can work individually as well as on a team.", "\n", "\nRESPONSIBILITIES OF POSITION:", "\n", "\n• Design/develop appealing and responsive customized websites that convert;", "\n• Identify problems and generate ideas for solutions for existing websites;", "\n• Maintain and edit client websites;", "\n• Manage multiple projects both independently and collaboratively.", "\n", "\nIN ORDER TO BE CONSIDERED:", "\n", "\n• 3yrs + experience with Illustrator and Photoshop is required; ", "\n• 3yrs + development experience with CSS3, HTML5 and JavaScript;", "\n• Proficient in Adobe Creative Cloud (specifically Photoshop, Illustrator, Dreamweaver, and InDesign);", "\n• Portfolio that demonstrates strong layout skills and understanding of UI and UX concepts;", "\n• Understanding of current industry trends and best practices;", "\n• Strong understanding of typography, layout and color;", "\n• Excellent interpersonal skills with strong desire to move projects forward and be proactive;", "\n• Extremely organized and detail-oriented;", "\n• Excellent time management skills required for meeting deadlines while managing workload;", "\n• Knowledge of full Adobe CC Suite and Microsoft Office, a plus; and", "\n• Basic knowledge of HTML, CSS, JS and JQuery, also a plus.", "\n", "\nIdeal candidate has deep experience in managing Word Press content sites and blogs.", "\n", "\nThis position is full-time and in-house. Compensation is commensurate with experience. In order to apply, please send your cover letter and resume in pdf format, as well as a link to your portfolio.    "], "link": "https://sandiego.craigslist.org/csd/web/d/rockstar-web-designer/6559193930.html", "compensation": "$20/hr + Based on experience", "date": "2018-04-12 11:09"},
{"type": "contract", "text": "Graphic Designer- Freelance PART TIME ONSITE", "address": ["\n        ", "\nOur client, a top gifting company, is looking for the help of a freelance Digital Designer! This will be onsite freelance with FLEXIBLE PART-TIME work needed during core hours (8a-6p).", "\n", "\nYou will be working under the Creative Director and Art Director on an online gifting brand creating assets in support of their seasonal marketing campaigns that will be running across web, email, mobile, display ads, and even some print work. You will be working with an established style and brand guide to execute assets.", "\n", "\nThe ideal candidate has:", "\n+ 3 years of experience", "\n+ Strong digital chops - email experience highly preferred! ", "\n+ eCommerce or food brand experience is a MUST", "\n+ Photoshop, InDesign and Illustrator PRO!", "\n+ Clean, modern design approach", "\n+ Great typography, composition and color/image optimization", "\n+ Excels in a corporate, fast-paced environment", "\n", "\nIf you are looking to be part of exciting brand growth and have the name of publicly traded company on your resume - this is an exciting and RARE opportunity! Apply Today!    "], "link": "https://sandiego.craigslist.org/csd/web/d/graphic-designer-freelance/6559317986.html", "compensation": "DOE // up to $26ph", "date": "2018-04-12 12:58"},
{"type": "full-time", "text": "Web Development Specialist  w/Design Skills- Fulltime", "address": ["\n        ", "\nOur client, a top healthcare company in North County is looking to hire a Full-time Marketing Web Development Specialist. ", "\n", "\nThe Web Development Specialist provides technical design and support, across all marketing channels. You will be responsible for web and digital initiatives to enhance lead generation and promoting corporate branding across all channels.  ", "\n", "\nYour responsibilities will include:", "\n-Provide digital designs for mobile app designs, web banners, landing pages, and/or e-mails", "\n-Design for websites for HTML and CSS  ", "\n-Design and code HTML e-mails templates and forms for different service lines, adhering to brand standards", "\n-Design and deploy campaigns within Pardot system (including e-mail campaigns, newsletters, lead gen campaigns)", "\n-Implement strategies to track & report results for website, SEO, PPC, social media performance and activity using web analytics tool", "\n", "\nThe ideal candidate has:", "\n-3-5 years web design experience and working within marketing environment", "\n-Experience working with Pardot or other e-mail management systems", "\n-Experience working with Salesforce.com or other CRM systems", "\n-Comfortable working with Google Analytics and conversion optimization tools", "\n-Proficient in HTML, CSS and JavaScript and Adobe Creative Suite", "\n", "\nThis is a highly sought-after company with great benefits, perks and opportunity for growth. Interested? Apply today!    "], "link": "https://sandiego.craigslist.org/csd/web/d/web-development-specialist/6563858692.html", "compensation": "up to $60k/DOE", "date": "2018-04-17 12:15"},
{"type": "full-time", "text": "Web Developer - Full time position", "address": ["\n        ", "\nImmediate opening available. - NOT FOR TELECOMMUTERS", "\n", "\nWe have a full time in house web development position on our development team.", "\n", "\nYou will be working on responsive wordpress site templates and custom builds with the possibility of custom projects requiring PHP and an understanding of SQL queries. ", "\n", "\nStrong work ethic, ability to learn quickly, love of technology and the creative process along with good communication skills are the most important attributes we seek. Being able to start immediately is a plus.", "\n", "\nRequirements", "\nPHP, SQL, CSS, @media queries, photoshop, wordpress", "\n", "\nPluses but not required", "\njQuery, API's, CLI", "\n", "\n* only resumes with examples will be acceptable. Only local residents.    "], "link": "https://sandiego.craigslist.org/csd/web/d/web-developer-full-time/6565494220.html", "compensation": "Based on experience", "date": "2018-04-19 08:24"},
{"type": "part-time", "text": "Graphic Designer / Web Designer - Part time", "address": ["\n        ", "\nWe are looking for a talented part time web designer with the possibility of going full time. ", "\n", "\nAre you a creative type that can take direction and produce stunning websites, landing pages, eblasts and graphical ads? Are you looking to pick up hours outside of your freelance, school, or other obligations. This is the position for you. You would be working directly with multiple departments in helping us with ads and website design mock ups. ", "\n", "\nIf you have an eye for design, please send us a resume along with works that you have completed. ", "\n", "\nThis is an in house position. ", "\n", "\nRequirements:", "\nProficient in Photoshop/Illustrator ", "\n", "\nOther:", "\nUnderstanding of responsive websites and wordpress is a plus.", "\n", "\n* Only local San Diego residents need apply.", "\n** Must submit resume with design examples.    "], "link": "https://sandiego.craigslist.org/csd/web/d/graphic-designer-web-designer/6565681710.html", "compensation": "Depends on experience", "date": "2018-04-19 11:00"},
{"type": "part-time", "text": "Web and Graphic Designer and Social Media Director/Manager.", "address": ["\n        ", "\nThe Missiongathering Movement (MGM) is looking for a innovative, creative web and graphic designer and social media director/manager. ", "\n", "\nMissiongathering Movement is (a progressive church planting and revitalization organization)", "\n", "\nWe are start-up organization/ministry, that's planting progressive Christian churches throughout the united states. We have two establish churches in San Diego Ca and Charlotte NC and are in the process of starting two more churches, in Issaquah/Seattle Wa and the other in Denver Co.  ", "\n", "\nJob Description:", "\nThe MGM web/graphic designer/developer is responsible for the design, layout, and coding of the MGM and church websites. They are involved with the technical and graphical aspects of a website and publications - how the site works and how it looks. She/he will also be involved in the maintenance and update of existing websites and social networks i.e. Facebook, Twitter, and Instagram.", "\n", "\nAfter the ministry leadership team establishing the target/church audience for the website and identifying the type of content it will host, a web designer/developer will:", "\n·   \twrite the programming code, either from scratch or by adapting existing website software and graphics packages to meet the organization's requirements", "\n·   \ttest the website and identify any technical problems", "\nupload the site onto a server and register it with different search engines", "\n", "\nHours and Environment:", "\nThe web/graphic designer/developer will work as part of our small but fun, very chilled ministry team.", "\nThe web/graphic designer/developer will work part-time. Yet, we are looking forward to becoming a full-time position.", "\nAdditional hours may be required to meet deadlines, which could include evenings and weekends.", "\nIt is possible to be self-employed and work from home. Part-time and flexible hours. Since we do not have a San Diego office at the present time.", "\nIt is usual to work in an open-plan office environment. A limited amount of traveling may be required.", "\n", "\nSalary/Hourly Rate:", "\nAn experience, web/graphic designers/developers - $20 an hr.", "\nAn inexperienced just starting out individual will start at $15 an hr.", "\n", "\nSkills and Personal Qualities:", "\nA web/graphic designer/developer should:", "\nHave skills in software programming and graphics", "\nHave creativity and imagination (that's a given!)", "\nBe adaptable and able to pick up new techniques", "\nHave good interpersonal and communication skills", "\nBe able to work on their own or in a team", "\nBe able to work to tight deadlines", "\nBe thorough and precise in their work", "\nBe able to multi-task", "\nBe able to use their initiative", "\n", "\nInterests:", "\nIt is important to be interested/or possible experience in", "\nProgressive christian faith communities and theology (we are definitely NOT turn or burn christians!) ", "\nSocial justice issues i.e. Environmental, racial and lgbtq equality", "\nNeeds to be comfortable in a diverse christian community", "\nKeeping up to date with advances in computer technology and how this affects the ministry and nonprofit environment", "\nThe internet ", "\nTroubleshooting and problem-solving.", "\nAnd of course King of Thrones, Stranger Things, Handmaids and anything on HBO and Netflix! LOL!", "\n", "\nIf you're interested and making a difference in the lives of people, please reach out asap!", "\n", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/web-and-graphic-designer-and/6565870761.html", "compensation": "An experience, web/graphic designers/developers - $20 an hr. An inexperienced just starting out individual will start at $15 an hr.", "date": "2018-04-19 13:51"},
{"type": "part-time", "text": "Community Manager for Photography Category on GreatAt", "address": ["\n        ", "\n", "\nAre you are an experienced photographer with a stellar portfolio and a love for helping others succeed? Have you have invested heavily in your personal brand on social media and amassed a following of those interested in your talents and services?", "\n", "\n", "\nWe help service providers earn an independent living using our simple online earning tools. Freelance photographers and small photography businesses are perfect examples of service providers benefitting from the GreatAt community.", "\n", "\nLink: ", "\n", "\n", "\nOn a paid, part-time and remote basis, your job duties will include:", "\n", "\n", "\n", " ", "\n", "\n", "\n", "\nAs a result of this position, your personal and business exposure is likely to increase. The ideal candidate will be able to balance the responsibilities of the position while continuing to grow a successful personal business with high customer satisfaction and overall performance. Doing so helps amplify the message that successful, personable and talented Photographers are a perfect fit for GreatAt.", "\n", "\n", "\nCandidates should meet the following requirements:", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\nWe're excited to know you and thanks for considering this position. To learn more, please follow these steps:", "\n", "\nThank you and good luck,", "\n-The GreatAt Team", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/community-manager-for/6566023060.html", "compensation": "Starting at $45 /hr", "date": "2018-04-19 16:43"},
{"type": "full-time", "text": "Drupal Developer", "address": ["\n        ", "\nThe Low-Down:", "\n", "\nToday, Achieve Internet is experiencing tremendous growth and success. If you are looking to join an enthusiastic, bright team working with leading financial, healthcare, entertainment, and technology companies on true digital transformation development projects, then you've come to the right place!", "\n", "\nWhat you'll have:", "\n", "\nA comfortable and fun work environment very conducive to teamwork and personal growth.", "\n", "\nThe opportunity to deliver on dynamic and engaging projects for the world's top brands. Leveraging our Drupal skills, we're going deep into the digital ecosystem to transform ourselves and our clients.", "\n", "\nOf course, we're agile, yet we don't stop there, we're diving into the practice or MVSE. The idea of small experimental development sprints allowing our developers to fail fast and often.", "\n", "\nThe usual perks-", "\n", "\nMedical, vision, and dental benefits.", "\n", "\nVacation and sick time.", "\n", "\n401K retirement plan.", "\n", "\nTuition reimbursement.", "\n", "\nThe extra perks-", "\n", "\nEndless supply of a variety of tasty snacks.", "\n", "\nDaily group coffee excursions", "\n", "\nCompany outings to San Diego sporting events, local craft breweries, parks, and more!", "\n", "\nWeekly Lunch and Learns where you'll enjoy information-rich presentations and catered lunch.", "\n", "\nUse of new, fully-loaded beach cruiser bikes for zipping around the streets of downtown San Diego during lunchtime.", "\n", "\nOther in-office stress relieving toys for when you need a refresher (video games, putting greens, Nerf guns, etc.)", "\n", "\nWhat you'll be doing:", "\n", "\nDeveloping advanced web and mobile platforms primarily in the open source space.", "\n", "\nInstalling and configuring Drupal-powered websites.", "\n", "\nDive into the Google Cloud Product (GCP) Ecosystem.", "\n", "\nCode review.", "\n", "\nPatching existing modules for additional functionality and applying security updates to existing sites.", "\n", "\nCollaborating with our Project Management team to build requirements documents, estimates, and specifications for client projects.", "\n", "\nConducting client contact throughout the development process.", "\n", "\nYour skills:", "\n", "\n5+ years of experience with PHP.", "\n", "\nExperience with MySQL (preferably MySQL 5).", "\n", "\nWorking knowledge and experience with Drupal.", "\n", "\nExperience creating client documentation.", "\n", "\nKnowledge of AJAX, JavaScript, XML a plus.", "\n", "\nClient relations.", "\n", "\nTo explore all that Achieve Internet has to offer and chat about the greatness you can bring to Achieve Internet, please submit resume, cover letter, and salary requirements.    "], "link": "https://sandiego.craigslist.org/csd/web/d/drupal-developer/6566621194.html", "compensation": "Based on experience. $70,000-90,000+", "date": "2018-04-20 10:44"},
{"type": "full-time", "text": "Immediate opening - Entry level web developement", "address": ["\n        ", "\nImmediate opening available. - NOT FOR TELECOMMUTERS", "\n", "\nWe have an \"Entry Level\" full time web development position on our development team working on edits and corrections for live websites and projects still in development.", "\n", "\nGraphic design and multimedia talent and skills can be strong factors in your favor, but also not necessary. Web design or PHP talent and training is also a big plus.", "\n", "\nStrong work ethic, ability to learn quickly, and love of technology and the creative process are most important attributes we seek. Get paid to learn the tech you love in a casual but dynamic environment. ", "\n", "\nOnce again, this is an entry level position to help in our development team that works closely with a great team of people. Being able to start immediately is a plus.", "\n", "\nMust supply resume - Local Residents Only.", "\n", "\nRequirements", "\nhtml, css, @media queries, photoshop, illustrator, wordpress", "\n", "\nPluses but not required", "\nPHP, JS, SQL, API's    "], "link": "https://sandiego.craigslist.org/csd/web/d/immediate-opening-entry-level/6566883819.html", "compensation": "Entry level based on experience", "date": "2018-04-20 14:36"},
{"type": "full-time", "text": "IT Tech (Entry Level)", "address": ["\n        ", "\nLabocaregen is a just start up company,  We are currently looking for a IT Tech with  entry level who will do Web design,  E-commerce and Web  maintenance.", "\nIt is a full time job, but most time can work at home. College student is OK. ", "\nRequired to have web design with WP.  E-commerce and Web maintenance experience.", "\nNeed working permit, It is best to know and understand Chinese, but not necessary.", "\nPlease send your CV to hire@batj.net, no phone call about this job.    "], "link": "https://sandiego.craigslist.org/csd/web/d/it-tech-entry-level/6543471334.html", "compensation": "DOE", "date": "2018-03-26 10:24"},
{"type": "full-time", "text": "Full-Time Web Developer", "address": ["\n        ", "\nTaylor & Pond is an established Interactive/Digital Media Agency looking for a multi-faceted web developer who is well-versed in WordPress and front-end CSS and JS and that works well in a fast-paced team environment. This is an in-house position located at our offices in San Diego, California, close to the downtown area. Multi-tasking, client mind-reading and an understanding of urgency is definitely required. Our level of customer service is a key competitive advantage. This position will never be dull, and you may be working on the front end and the back end of a website on any given day.", "\n ", "\nTake a look at these required skills and if it reads like a match then please submit your resume:", "\n", "\n-Experience developing custom WordPress themes", "\n-Highly skilled in HTML5/XHTML, CSS3, and JavaScript/jQuery", "\n-Good eye for layout/design", "\n-Ability to resolve cross-browser compatibility issues, ability to build to responsive", "\n-Ability to develop pixel perfect implementations of Photoshop comps", "\n-Experience developing for mobile environments", "\n-Experience integrating with Content Management Systems such as Magento, WordPress, Shopify and/or DotNetNuke", "\n-Experience with git or other version control", "\n-Creative Thinker and Problem Solver", "\n-Excellent verbal and written skills", "\n", "\nAbsolute MUST HAVES:", "\n", "\n-3+ years of solid web development experience using CSS, JavaScript and Photoshop", "\n-You will need to be highly skilled in HTML5 & CSS3, PHP templates and be able to lead a deployment of high-end websites", "\n-Ability to take a PSD page layout and convert to HTML, CSS, JavaScript/jQuery", "\n-U.S. Citizen/Greencard/Valid work Visa for U.S.", "\n-Good Communication Skills", "\n-Extremely Detail-Oriented", "\n ", "\nNice to Haves:", "\n", "\n-Experience developing custom WordPress functionality and/or plugins", "\n-Experience with ACF", "\n-Experience with Cordova or Native iOS/Android App development", "\n-Experience with ASP.NET", "\n-Experience managing Apache and/or IIS servers", "\n-Experience with DNS", "\n ", "\nOur clients are diverse and there is ample opportunity to take on a variety of interesting projects so let us know about any other skills and interests in the programming realm that you may have.", "\n", "\nThis position is a full time and in-house. Please send a copy of your resume and portfolio along with your salary requirements in order to be considered.    "], "link": "https://sandiego.craigslist.org/csd/web/d/full-time-web-developer/6543685221.html", "compensation": "Varies with experience and qualifications", "date": "2018-03-26 13:17"},
{"type": "part-time", "text": "Web Designer / Developer (In-House)", "address": ["\n        ", "\nSmall internet marketing firm located in Oceanside, CA. We are looking for a dedicated, hardworking Web Designer/Developer to join our team. Ideal candidate must be strong in both design and in development and work out of our Oceanside office.", "\n", "\nThis position will start at 20-30 hrs per week.", "\n", "\n- Solid Photoshop Skills", "\n- Good eye for design", "\n- Good Understanding of PHP", "\n- Good Understanding of JS", "\n- Solid understanding of HTML5 and CSS3", "\n- Solid Understanding of the Wordpress Framework and Theme Development", "\n- Experience with Responsive Design", "\n", "\nBonus Points if You Know The Following:", "\n", "\n- Bootstrap Framework", "\n- Solid Understanding of PHP", "\n- Solid Understanding of JS", "\n- Good Understanding of SEO", "\n- Good Understanding of Adwords & Conversion Tracking", "\n- Solid Understanding of a LAMP stack server", "\n", "\nIMPORTANT: When replying please send in portfolio of design and development work you have completed + your resume.", "\n", "\nOther Details:", "\n* Non-Smokers/Non-Vapors only", "\n", "\nPlease put the sum of 3 and 4 in the subject line so I know you've read the ad thoroughly. Thank you.    "], "link": "https://sandiego.craigslist.org/nsd/web/d/web-designer-developer-in/6543847285.html", "compensation": "$35 - $45 Per Hour To Start DOE", "date": "2018-03-26 15:53"},
{"type": "contract", "text": "Production Designer - Freelance", "address": ["\n        ", "\nOur client is looking for a Production Designer to join their team on a freelance basis! This will be onsite freelance with the potential to extend and turn in to a full-time role down the line.", "\n", "\nYou will be working closely with the creative team following the direction of the lead Art Director focusing on production of print marketing materials, some packaging, and web banners.", "\n", "\nWe're looking for:", "\n- 3+ years of print + production design experience", "\n- Proficiency in the Adobe Creative Suite ", "\n- A strong attention to detail", "\n- An eye for layout + creative ", "\n- a portfolio with a range of contemporary design deliverables", "\n- Light HTML skills (huge plus!)", "\n", "\nLooking for more freelance or full-time job opportunities? Let us know you're available + looking by applying to our website www.creativecircle.com today!", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/production-designer-freelance/6544347581.html", "compensation": "DOE", "date": "2018-03-27 08:44"},
{"type": "part-time", "text": "Social Media Posting - Work at Home", "address": ["\n        ", "\nWe assist businesses with getting found online for their services.", "\n", "\nWe need people to help us with posting online.", "\n", "\nCompensation: $25 per hour", "\n", "\nIf you would like to get hired for this position, please go to: ", " and fill out the form.    "], "link": "https://sandiego.craigslist.org/nsd/web/d/social-media-posting-work-at/6544600841.html", "compensation": "$25 per hour", "date": "2018-03-27 12:06"},
{"type": "full-time", "text": "POSITION: Experienced Web Designer & Front End Developer", "address": ["\n        ", "\nDisclaimer: Please do not apply if you are fresh out of a code school or have less than 2 years experience in a professional environment. In-office only.", "\n", "\nAbout Us:", "\nLive Commerce is an eCommerce company that creates brands and markets directly to the consumer. ", "\n", "\nYou'll be a part of taking a product from concept to massive scale. They don't teach this kind of stuff anywhere!", "\n", "\nOver the past few months we've had exponential growth. We've grown to have dozens of workers in our fulfillment and customer service centers located across the country.", "\n", "\nThis position is for the headquarters based in Downtown San Diego right next to Horton Plaza.", "\n", "\nOur office is a super casual environment that promotes creativity and camaraderie.", "\n", "\nOur team is our biggest asset. We cover: ", "\n100% Health benefits", "\nPremium gym membership", "\nTraining", "\nOffice snacks", "\nTeam lunches", "\n", "\nWhat we're looking for:", "\nSomeone who can own a project from start to finish.", "\nPositive and friendly. ", "\nAccepts all challenges and knows nothing is impossible.", "\nCan always find a way to complete a goal.", "\nUnderstands driving sales and growth is more important than writing beautiful code.", "\n", "\nSkills we're looking for:", "\nStrong HTML5, CSS3 & JavaScript", "\nUnderstanding of A/B and Multi-variate testing", "\nStrong knowledge of standards-based web development and cross-browser compatibility (Responsive Design)", "\nStrong knowledge of page speed optimization", "\nVersion control (Git)", "\nPhotoshop / Illustrator", "\nEcommerce experience is a +", "\nServer side knowledge is a ++", "\nExperience or knowledge of split testing, measuring conversion metrics etc is a +++", "\n", "\nResponsibilities:", "\nDesign, develop, and improve pieces of our sales funnel", "\nManage our growing list of web properties (over 100).", "\nHelp provide direction to our outsourced development team where needed.", "\n", "\nCompensation:", "\nCompensation is $70-100k/yr DOE, with medical and dental. As we are a fast-growing company, you will have opportunities to take on additional responsibilities and grow in your role!    "], "link": "https://sandiego.craigslist.org/csd/web/d/position-experienced-web/6544873698.html", "compensation": "Compensation is $70-100k/yr DOE, with medical and dental.", "date": "2018-03-27 16:37"},
{"type": "full-time", "text": "Full Time Graphic Designer", "address": ["\n        ", "\nAre you a graphic designer that is experienced in designing for the web including banner ads, social media graphics, websites, and GIFs? Are you comfortable working in video editing software to make simple motion graphics or made-for-the-web videos? ", "\n", "\nJob Description:", "\nThe Digital Graphic Designer will provide graphic design services, development services, and video services, QA client deliverables, and provide general design input and direction.", "\n", "\nYou will be responsible for :", "\n", "\n1. Design of social media graphics, banner ads, websites, landing pages, microsites, branding documents, and other graphic design deliverables", "\n2. Development and coding of email templates and deliverables", "\n3. Design and creation, and formatting of motion graphics, GIFs, and video ads ", "\n4. Work with clients on the development and design  of projects", "\n5. Provide design guiding eye and review", "\n", "\nMust be an expert in the following applications:", "\nAdobe Photoshop", "\nAdobe Illustrator", "\nAdobe InDesign", "\nAdobe Premiere", "\nFinal Cut Pro", "\nAdobe After Effects", "\nHTML/CSS", "\nJavaScript", "\n", "\nPlease send resumes to Julie@nexusrecruiter. Include link to your portfolio and examples of banner ads and web graphics.", "\nA design test will be part of the interview process.", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/full-time-graphic-designer/6545538196.html", "compensation": "DOE", "date": "2018-03-28 11:32"},
{"type": "full-time", "text": "User Interface (UI & UX) Designer - Fun Start-Up in Vista", "address": ["\n        ", "\nWe're seeking a highly creative, detail-oriented user interface designer with web/interactive design skills to serve as a User Interface/User Experience Web Designer. The ideal candidate will be comfortable and adept at self-management, possess strong creative concepting skills, have experience in all major design platforms, and is looking for a long-term, prosperous and challenging career.", "\n", "\n", "\n", "\nWe need a person with:", "\n", "\n- 3+ years of UI/UX experience", "\n- Proficient in project/client discovery, developing web strategies, site maps, and wireframes", "\n- Proficient in UX design", "\n- Excellent visual design skills including strong typography and hierarchy understanding", "\n- Up-to-date with the latest UI trends, techniques and technologies", "\n- Experience designing for web and mobile applications", "\n- Proficient in moodboards online branding, and style-guides", "\n- Extensive skills in and control of the following applications: Photoshop, Illustrator, InDesign", "\n- Familiar with HTML and CSS", "\n- Strong attention to detail and organized, production-ready file structure", "\n- High comfort level in presenting in a client setting", "\n- Ability to work autonomously or in a team setting", "\n- Strong work ethic    "], "link": "https://sandiego.craigslist.org/nsd/web/d/user-interface-ui-ux-designer/6547800342.html", "compensation": "BOE", "date": "2018-03-30 18:27"},
{"type": "part-time", "text": "Part-time Graphic/Web Designer and/or Paid Internship Position", "address": ["\n        ", "\nAbout i-SAFE Ventures", "\ni-SAFE Ventures is a nonprofit focusing on \"social impact\" as it relates to educating and empowering our nation's youth on safe and responsible cyber citizenship in today's global economy. ", "\nAbout the Position", "\ni-SAFE Ventures is searching for experienced and \"creative\"  graphic design talent. Qualifications include:\t", "\n•\tThinking creatively to produce new ideas and concepts", "\n•\tContributing ideas and design artwork to the overall mission", "\n•\tWorking on layouts and produce art in digital and print format", "\n•\tPossess understanding of multimedia design and experience building files for both print and digital", "\n•\tDemonstrate hands-on skills in the latest Adobe Creative Suite", "\n•\tHave the ability to manage projects and remain flexible while keeping a keen attention to detail", "\n•\tExperienced in designing email campaigns, banner ads, website assets and print projects that are  creative/contemporary design and obtain results", "\n•\tDevelop images, pictures and ads for social media platforms ", "\n•\tDevelop the layout and production design of publications", "\n•\tHave knowledge/experience in web design html, CSS and Drupal themes, templates and render functions", "\n•\tUnderstanding/knowledge of Drupal 7 and this includes coding standards as it pertains to web design", "\n•\tWell versed in user experience, user interface design, usability, accessibility, browser compatibility and A/B testing experience", "\n•\tPossess a solid foundation in web standards, accessibility, responsive design and typography", "\nAs a graphic designer you will be reporting directly to the Creative Director.  You need to have the ability to work within tight deadlines and maintain your creativity!  Must be able to multi-task; possess excellent time management skills; be a team player and demonstrate excellent people skills.", "\n", "\nRequired Skills:", "\n•\tGraphic Design", "\n•\tLayout Design", "\n•\tInterface Design", "\n•\tWeb design ", "\n•\tBranding", "\n•\tMust be familiar with the Macintosh platform including OSX and PC platform", "\n•\tMust be skilled Adobe Creative Suite (Photoshop, Illustrator, InDesign, Dreamweaver)", "\n•\tFamiliarity with HTML and CSS", "\n•\tMust be familiar with the Drupal environment", "\nBonus Skills:", "\n•\tDreamweaver", "\n•\tWordPress", "\n•\tAdobe Captivate", "\n", "\nCould work into a full-time position    "], "link": "https://sandiego.craigslist.org/nsd/web/d/part-time-graphic-web/6550850386.html", "compensation": "to be discussed based on experience", "date": "2018-04-03 11:25"},
{"type": "employee's choice", "text": "Website Developer Wanted - Remote work not accepted - Magento", "address": ["\n        ", "\nRemote work is not accepted.", "\n", "\nLeo Hamel Fine Jewelers, a successful, upscale jewelry store serving San Diego County for over 35 years, is looking for an in house website developer. This position will report to the Director of IT. The ideal candidate will have a proven ability to work well in a team environment yet be self-driven to make sure critical tasks are handled.", "\n", "\nVerifiable Magento experience is preferred. Candidates that are not proficient with Magento will not be considered. All candidates must have 5+ years of programming experience and pass a background check.", "\n", "\nEssential Duties:", "\n•\tContinue ongoing development of www.LeoHamel.com", "\n•\tCreating templates", "\n", "\nMust be proficient in:", "\n•\tResponsive Web Design", "\n•\tUX Layouts", "\n•\tPHP 5.5", "\n•\tHTML5", "\n•\tJavaScript", "\n•\t jQuery", "\n•\tSass", "\n•\t GIT", "\n•\tFoundation 5.5.3", "\n", "\nBeneficial experience:", "\n•\tPHP 7", "\n•\tFoundation 6.4.1", "\n", "\nPlease send your resume with job experience, examples of prior design layouts and include your desired salary range. Pay depends on skill level. Submit your resume with \"Green Gecko\" as the subject.", "\n", "\nIf you are professional and passionate about what you do, if you enjoy spending your days with friendly coworkers in a lively work environment, if you like working with a winning team, then this may be the job for you! Your success and advancement will depend on your commitment and drive. ", "\n", "\nWe are dedicated to excellence in all that we do and provide valuable ongoing training. We offer a competitive benefits package including 401k, FSA, medical/dental co-pay, paid time off, paid holidays, training, employee discount, dues and memberships. ", "\n", "\nWorkweek is Tuesday - Saturday with some Mondays or Sundays during the peak Christmas season.", "\n", "\nLeo Hamel Fine Jewelers is an Equal Opportunity Employer and provides equal employment opportunities to all qualified individuals without regard to their age, race, color, religion, national origin, sex, disability, sexual orientation, or any other characteristic protected by law. Although we strive to match qualified candidates with available jobs, please note that interviewing is not a guarantee of employment.", "\n", "\nPrincipals only, no recruiters.", "\nDo not call about this job, email resume.", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/website-developer-wanted/6551880218.html", "compensation": "DOE", "date": "2018-04-04 12:24"},
{"type": "full-time", "text": "Web Designer/Developer", "address": ["\n        ", "\n", "\nAdvanced Mechatronics Solutions, Inc. is a fast growing company dealing with factory automation & machinery distribution and engineering support to various manufacturing industries. ", "\nWe are currently seeking a highly motivated and career minded Web Design/Developer with a strong work ethic.", "\n", "\nResponsibilities:", "\n", "\n-Plan, Create, Develop high-converting web design across desktop, mobile and tablet platforms", "\n-Support in catalog and various graphic design projects", "\n-Proactively seek necessary information on project requirements to ensure clarity and alignment on timelines and deliverables", "\n-Take initiative and responsibility to contribute to smooth work flow and project management of key projects or assignments.", "\n-Update new item profiles ", "\n-Maintain web best practices and user experience optimization", "\n", "\nQualifications:", "\n", "\n• Proven ability to manage multiple projects at a time while paying attention to details", "\n• 3yrs+ experience with Illustrator, Photoshop, InDesign", "\n• 3yrs + experience with CSS3, HTML5 and JavaScript ", "\n• Working knowledge of Wordpress and similar apps", "\n• Bachelor's in Fine Art Design, Marketing degree or equivalent work history", "\n• Manufacturing experience a plus", "\n• Ability to absorb and apply constructive criticism from peers", "\n", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/web-designer-developer/6552804978.html", "compensation": "TBD", "date": "2018-04-05 12:01"},
{"type": "part-time", "text": "Website Changes", "address": ["\n        ", "\nPopular Irish Pub is looking for someone experienced with WordPress. We have an existing website but would like changes made to it. ", "\n", "\nPlease send resume to email provided. ", "\n", "\nCheers!    "], "link": "https://sandiego.craigslist.org/csd/web/d/website-changes/6554058939.html", "compensation": "hourly", "date": "2018-04-06 17:07"},
{"type": "full-time", "text": "Mid/Senior Full Stack PHP/Web Developer", "address": ["\n        ", "\nBelow is a BRIEF job description for one of our clients who is searching for a Full Stack PHP/Web Developer. This is a full time, onsite position and our client is not accepting any sponsorship. Please do not submit your information if you are unable to fulfill those two requirements. ", "\n", "\nJob Responsibilities:", "\nContribute to the ongoing development of our internal loan origination software system.", "\nContribute to the planning and development of any new company software systems.", "\nIdentify code, database, and infrastructure vulnerabilities/bottlenecks, and implement solutions.", "\nParticipate in peer code test and review.", "\n ", "\nBasic Minimum Requirements:", "\nBachelor's degree in Computer Science or IT related field.", "\nPrevious experience in the Financial Services industry.", "\n5+ years as a LAMP stack developer with full life-cycle product development experience.", "\nA solid understanding of CS fundamentals (data structures, algorithms, etc.).", "\nAdvanced experience with Object Oriented coding, as well as modern coding principles.", "\nExtensive knowledge of web development, specifically with PHP/MySQL.", "\nExtensive knowledge coding with Laravel MVC framework.", "\nProficiency utilizing GIT version control in a team environment.", "\nProficiency with secure coding principles and design.", "\nProficiency with front end coding including HTML, Javascript, CSS and responsive web design.", "\nExperience with relational databases, schema design and optimization.", "\nExperience connecting with and utilizing 3rd party APIs (REST, SOAP, XML).", "\nFamiliarity with agile development methodologies.", "\nProven ability to work successfully with limited supervision.    "], "link": "https://sandiego.craigslist.org/csd/web/d/mid-senior-full-stack-php-web/6556301240.html", "compensation": "80k-110k", "date": "2018-04-09 11:22"},
{"type": "contract", "text": "Graphic Designer (Print) - Freelance", "address": ["\n        ", "\nOur client, a leader in the hospitality industry, is looking for a Graphic Designer to help their team for a 3 month onsite freelancing opportunity!", "\n", "\nAs the Graphic Designer, you will be focused on creating all print, marketing collateral. You will be responsible for designing direct mailers, signage, flyers, brochures, etc. for a variety of different resorts and restaurants. ", "\n", "\nIdeal Candidate:", "\n- 3+ years experience in PRINT design", "\n- Comfortable working in PC environment", "\n- Proficient in Adobe Suite", "\n- Experience working in hospitality is a PLUS!", "\n", "\nYou'll be working closely with their entire marketing team and have the opportunity to strategically concept new marketing promotions to produce on all marketing collateral.", "\n", "\nIf you're a hard worker who can produce creative print collateral designs - apply today!", "\n    "], "link": "https://sandiego.craigslist.org/csd/web/d/graphic-designer-print/6556309588.html", "compensation": "up to $28 per hour", "date": "2018-04-09 11:28"},
{"type": "full-time", "text": "Email Specialist  w/Design Skills- Fulltime", "address": ["\n        ", "\nOur client, a top healthcare company in North County is looking to hire a Full-time Marketing Web Development Specialist. ", "\n", "\nThe Marketing Web Development Specialist provides technical design and support, across all marketing channels. You will be responsible for web and digital initiatives to enhance lead generation and promoting corporate branding across all channels.  ", "\n", "\nYour responsibilities will include:", "\n-Provide digital designs for mobile app designs, web banners, landing pages, and/or e-mails", "\n-Design for websites for HTML and CSS  ", "\n-Design and code HTML e-mails templates and forms for different service lines, adhering to brand standards", "\n-Design and deploy campaigns within Pardot system (including e-mail campaigns, newsletters, lead gen campaigns)", "\n-Implement strategies to track & report results for website, SEO, PPC, social media performance and activity using web analytics tool", "\n", "\nThe ideal candidate has:", "\n-3-5 years web design experience and working within marketing environment", "\n-Experience working with Pardot or other e-mail management systems", "\n-Experience working with Salesforce.com or other CRM systems", "\n-Comfortable working with Google Analytics and conversion optimization tools", "\n-Proficient in HTML, CSS and JavaScript and Adobe Creative Suite", "\n", "\nThis is a highly sought-after company with great benefits, perks and opportunity for growth. Interested? Apply today!", "\n", "\nAPR. 2018    "], "link": "https://sandiego.craigslist.org/csd/web/d/email-specialist-design/6556358642.html", "compensation": "up to $60k/DOE", "date": "2018-04-09 12:08"},
{"type": "contract", "text": "Sr. UX/UI Designer- Freelance", "address": ["\n        ", "\nOur client, a boutique User Experience and Design studio, is looking for a freelance Sr. UX/UI Designer to join the team.", "\n", "\nHere's what you'll be doing:", "\n-Develop and interpret design requirements", "\n-Generate, sketch and illustrate design ideas", "\n-Communicate interaction design with wireframes and user-flow diagrams", "\n-Create high fidelity interactive prototypes", "\n-Iterate on designs through evaluations", "\n-Design and produce development ready assets", "\n-Present your designs to stakeholders and respond to feedback with composure", "\n ", "\nBackground we need:", "\n-5+ years experience designing in a product or software development process", "\n-A proven understanding of the user-centered design process and data-driven design", "\n-Exceptional communication and presentation skills", "\n-Software visual design sensibility", "\n-Prototyping in Axure, InVision, Proto.io, OmniGraffle, Balsamic, HTML5 or equivalent", "\n-Proficiency in Adobe Creative Cloud and Sketch", "\n-Passion for technology", "\n", "\nThis is an exciting project and foot in the door with a hot shop in San Diego that does exceptional work! Apply today! This will be ONSITE freelance in Normal Heights.    "], "link": "https://sandiego.craigslist.org/csd/web/d/sr-ux-ui-designer-freelance/6556360788.html", "compensation": "up to $50ph/DOE", "date": "2018-04-09 12:10"},
{"type": "contract", "text": "Graphic Designer - Freelance to Fulltime", "address": ["\n        ", "\nOur client is a lifestyle/retail brand in North County looking to hire a freelance Production Artist with a solid CPG background! This will be onsite freelance ongoing and possibility for full-time down the line.", "\n", "\nIn this role, you will be reporting in to the Art Director and working closely with their in house designers. This role is heavily focused on production design and the workload will be mostly print deliverables including packaging, POP, in store displays, and tech packs.", "\n", "\nWe're looking for:", "\n- 3+ years of heavy print + production design experience", "\n- Experience in the lifestyle, retail or action sports industry", "\n- Proficiency in Adobe Photoshop, InDesign and Illustrator", "\n- Strong attention to detail", "\n- Ability to work with printers + prep files for print", "\n- Creative eye ", "\n- Hip / contemporary portfolio (highly preferred!)", "\n", "\nThis is an exciting opportunity to work at growing lifestyle brand on a cool creative team with a great work culture + hours flexibility!", "\n", "\nAPR. 2018    "], "link": "https://sandiego.craigslist.org/csd/web/d/graphic-designer-freelance-to/6556377595.html", "compensation": "DOE // up to $30/hr", "date": "2018-04-09 12:24"},
{"type": "contract", "text": "UX/UI Designer - Freelance", "address": ["\n        ", "\nOur client, a global leader in medical devices space, is in need of an Interaction Designer / UX/UI Designer for the next year! This will be onsite freelance working closely with their in house team in the Sorrento Valley area.", "\n", "\nYou will be working on the UX team on a cloud-based software and knowledge portals. The design challenges will require rapid Axure prototyping and clearly communicating data analytics through infographics. This role will require a combination of prototyping, interaction design, and visual design expertise.", "\n", "\nDay to day will include:", "\n", "\n- Delivering UI specifications, wireframes, workflows, and high-fidelity Axure prototypes", "\n- Collaborating with key product stakeholders ", "\n- Working collaboratively with cross-functional teams", "\n", "\nRequirements:", "\n- 5-7+ years of experience designing software apps in a fast-paced, collaborative environment", "\n- Someone who is collaborative and can liaise with design, development and marketing teams seamlessly ", "\n- Adobe CS Pro and proficient in Axure and InVision", "\n- Basic Understanding of HTML/CSS", "\n++ Experience with Healthcare, Medical Devices are an added bonus so let us know if you have it!", "\n", "\nThis is an ONSITE freelance project for 12 months with a leader in the medical device field working with fast paced, collaborative team. Don't miss out on this opportunity- apply today!!", "\n", "\nAPR. 2018    "], "link": "https://sandiego.craigslist.org/csd/web/d/ux-ui-designer-freelance/6556385328.html", "compensation": "DOE // up to $45/hr", "date": "2018-04-09 12:31"},
{"type": "contract", "text": "Digital Designer / WordPress Developer- Freelance (OFFSITE FLEX)", "address": ["\n        ", "\nOur client, an award winning medical device and software company, is looking for a Digital Designer with solid website building experience to help on a project!", "\n", "\nOn this project, you will be working from strategy on a new product launch/ new business unit. Project deliverables will include designing + developing a WordPress website and digital campaign assets. This will be 80% design with 20% front end development.", "\n", "\nThe ideal candidate has:", "\n-5+ years of experience", "\n-Proficient in HTML, CSS, WordPress", "\n-Full scale digital campaign work (website, landing pages, emails and banner ads).", "\n-Modern, clean aesthetic", "\n-Designs with conversion optimization in mind", "\n-Strong communicator, can jump in and work well with internal teams and quickly iterate design and adjust throughout the project ", "\n-ENTREPRENEURIAL spirit and can speak to design decisions", "\n", "\nAdded bonus if you have:", "\n++ An Agency background", "\n++ Consumer facing work", "\n++ Have designed/marketed to a demographic of 55 and up", "\n", "\nIf you are available for an exciting project and want to get your foot in the door with a huge SD company, let us know!!! This is ONSITE freelance with some offsite flexibility.", "\n", "\nAPR. 2018    "], "link": "https://sandiego.craigslist.org/csd/web/d/digital-designer-wordpress/6556407873.html", "compensation": "DOE", "date": "2018-04-09 12:50"},
{"type": "part-time", "text": "Need P/T RE Licensee to assist with sales, escrow, social media", "address": ["\n        ", "\nSuccessful small real estate company needs part time licensee to assist with marketing, administration, sales, escrows, social media and web site.  Must have strong written and verbal communication skills.    "], "link": "https://sandiego.craigslist.org/nsd/web/d/need-t-re-licensee-to-assist/6556762216.html", "compensation": "based upon experience and ability", "date": "2018-04-09 19:40"},
{"type": "contract", "text": "Contract Shopify Coder Needed - store remake [RUBY/LIQUID/HTML]", "address": ["\n        ", "\nHello I am Sean.", "\n", "\nI am a small business owner selling to a small growing community; Bitcoin trading strategies. The old shopify site needs a new tune up. You will learn how to make money in the Bitcoin market, and help the community I have cultivated grow even larger. ", "\n", "\nI need someone who has some summer time to work part time WITH me to design and create a better shopify store selling memberships to a community. I would also accept this position as a paid internship if you need to make this time worked for school. ", "\n", "\nI will accept anyone who has intermediate skill in web design, understands Ruby and Liquid templates. Must have good communication skills, and is an honest hard worker. Having your own computer and working from home is a must. ", "\n", "\nPlease submit a live example of your work and an example of some RUBY or Liquid code you have written and explain what the code does a little, line by line. ", "\n", "\nRequired Knowledge: Shopify, HTML, CSS, RUBY, Liquid, Discord, Understands Bitcoin is a must, must live in San Diego and be able to drive to Point Loma to work at the office. Understands Social Media and how it integrates into a good website. Reports to an Airtable and shows work. Can work from home, and keep your own schedule. ", "\n", "\nTime Frame: Now-August", "\nSchedule: Hours are Completely flexible, you make your hours, One to Two days per week only. One day a week work WITH me in my office for a few hours to show me what you have completed. ", "\nDogs OK! bring him/her to work with us. ", "\n - No lifting or labor involved - There are some stairs to get into my office    "], "link": "https://sandiego.craigslist.org/csd/web/d/contract-shopify-coder-needed/6568396587.html", "compensation": "P.O.W. Contract Only - you invoice me", "date": "2018-04-22 11:13"},
{"type": "contract", "text": "Web Designer/Developer with an Eye for Design", "address": ["\n        ", "\nWe are Code Loft, a web development company creating custom web systems to meet the diverse needs of our clientele, which include businesses small and large in a variety of industries, from finance, to entertainment. We are looking for a Web Designer/Developer with a keen eye for design and the skills to execute their vision.", "\n", "\nThis is an in-house position, our Web Designer/Developer will need to work from our offices in downtown San Diego.", "\n", "\nJob Description", "\nAs our dedicated Web Designer/Developer you'll work closely with our Creative Director on our existing web platform, building templates for our product, while also building new functionality, designing interactions and planning for the future of our platform. You will also discuss and make recommendations about technology choices, branding, design and user interactions.", "\n", "\nOur success depends on delivering an experience to our users that is functional, intuitive and clean.", "\n", "\nResponsibilities:", "\nBuild website templates using our company's tools (training will be provided)", "\nBuild new functions and UI features for the main website", "\nDevelop and implement effective internal systems supporting Marketing, Sales and Editorial departments", "\nWork in a collaborative environment with other developers", "\n", "\nQualifications:", "\nA strong eye for design: from typography details, to full layouts", "\nAbility to innovate and work in a results-oriented environment", "\nAbility to explain technical subjects to a non-technical audience", "\nAbility to finish projects on time", "\nPhotoshop expertise", "\nHTML5", "\nCSS/CSS3", "\nJavascript / jQuery", "\n.PHP", "\nUI/UX", "\nResponsive / Media Queries and Cross-Browser Compatibility", "\nBootstrap or Foundation experience", "\nExperience with APIs through SOAP and REST is a plus", "\nPortfolio with examples of your most recent or relevant work", "\n", "\nOn replying to this post with your portfolio, please remember to include your best contact email in your communication to us so that we can respond promptly. Looking forward to hearing from you!    "], "link": "https://sandiego.craigslist.org/csd/web/d/web-designer-developer-with/6569485560.html", "compensation": "TBD based on experience.", "date": "2018-04-23 13:18"}
]